---
kind: method
id: M:Autodesk.Revit.DB.IFC.IFCData.op_Inequality(Autodesk.Revit.DB.IFC.IFCData,Autodesk.Revit.DB.IFC.IFCData)
source: html/36ed4a12-a9a5-0b4d-e1e3-b3a80285683d.htm
---
# Autodesk.Revit.DB.IFC.IFCData.op_Inequality Method

Determines whether two IFCDatas are different.

## Syntax (C#)
```csharp
public static bool operator !=(
	IFCData first,
	IFCData second
)
```

## Parameters
- **first** (`Autodesk.Revit.DB.IFC.IFCData`) - The first IFCData.
- **second** (`Autodesk.Revit.DB.IFC.IFCData`) - The second IFCData.

## Returns
True if the IFCDatas are different; otherwise, false.